import 'package:flutter/material.dart';

import 'package:akuCommunity/utils/headers.dart';
import 'package:akuCommunity/widget/bee_scaffold.dart';

class AgreementPage extends StatefulWidget {
  @override
  _AgreementPageState createState() => _AgreementPageState();
}

class _AgreementPageState extends State<AgreementPage> {
  @override
  Widget build(BuildContext context) {
    return BeeScaffold(
      title: '用户协议',
      body: SingleChildScrollView(
        padding: EdgeInsets.all(16.w),
        child: Text(
          '''
欢迎您使用“小蜜蜂智慧社区”APP软件及服务！
为使用“小蜜蜂智慧社区”APP软件（以下简称“许可软件”）及服务，您应当阅读并遵守《用户协议》（以下简称“本协议”）。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。限制、免责条款可能以加粗形式提示您注意。

一旦您下载安装使用许可软件，即表示您同意接受本协议所有条款和条件的约束。如您不同意本协议条款和条件，请勿使用许可软件，并请销毁所有许可软件副本。

请您注意，本协议不适用于您通过我们的产品/服务而接入的其他第三方产品/服务(“其他第三方”，包括您的交易相对方、任何第三方网站以及第三方服务提供者等)，具体规定请参照该第三方用户协议及隐私政策或类似声明。

第一部分 用户协议
一、协议的范围
1.1协议适用主体范围
本协议是您与深圳市凯达来科技有限公司（以下称凯达来）之间关于您下载、安装、使用、登录许可软件，以及使用许可软件提供的服务所订立的协议。

二、关于本服务
2.1本服务内容
本服务内容是指凯达来向用户提供的跨平台的生活助手（“小蜜蜂智慧社区”APP软件），同时提供由物业提供的基础服务、增值物业服务，周边商圈优惠信息，在线支付，政府提供的公共资源等服务内容。

2.2本服务形式
2.2.1 您使用本服务需要下载小蜜蜂智慧社区客户端软件，对于这些软件，凯达来给予您一项个人的、不可转让及非排他性的许可。

2.2.2 本服务中小蜜蜂智慧社区客户端软件提供包括但不限于iOS、android等多个应用版本，用户必须选择与所安装手机相匹配的软件版本。

2.3许可的范围
2.3.1 凯达来给予您一项个人的、不可转让及非排他性的许可，以使用许可软件。您可以为非商业目的在终端设备上安装、使用、显示、运行许可软件。

2.3.2 本条及本协议其他条款未明示授权的其他一切权利仍由凯达来保留，您在行使这些权利时须另外取得凯达来的书面许可。凯达来如果未行使前述任何权利，并不构成对该权利的放弃。

三、软件的获取
3.1 您可以直接从凯达来的网站上获取许可软件，也可以从得到凯达来授权的第三方获取。

3.2 如果您从未经凯达来授权的第三方获取许可软件或与许可软件名称相同的安装程序，凯达来无法保证该软件能够正常使用，并对因此给您造成的损失不予负责。

四、软件的安装与卸载
4.1 凯达来可能为不同的终端设备开发了不同的软件版本，您应当根据实际情况选择下载合适的版本进行安装。

4.2 下载安装程序后，您需要按照该程序提示的步骤正确安装。

4.3 为提供更加优质、安全的服务，在许可软件安装时凯达来可能推荐您安装其他软件，您可以选择安装或不安装。

4.4 如果您不再需要使用许可软件或者需要安装新版软件，可以自行卸载。如果您愿意帮助凯达来改进产品服务，请告知卸载的原因。

五、软件的更新
5.1 为了改善用户体验、完善服务内容，凯达来将不断努力开发新的服务，并为您不时提供软件更新（这些更新可能会采取软件替换、修改、功能强化、版本升级等形式）。

5.2 为了保证许可软件及服务的安全性和功能的一致性，凯达来有权不经向您特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。

5.3 许可软件新版本发布后，旧版本的软件可能无法使用。凯达来不保证旧版许可软件继续可用及相应的客户服务，请您随时核对并下载最新版本。

六、用户个人信息保护
6.1 保护用户个人信息是凯达来的一项基本原则，凯达来将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可凯达来不会向第三方公开、透露用户个人信息。凯达来对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。

6.2 您在注册账号或使用本服务的过程中，可能需要提供一些必要的信息，例如：为向您提供账号注册服务或进行用户身份识别，需要您填写手机号码、住址信息等。若国家法律法规或政策有特殊规定的，您需要提供真实的身份信息。若您提供的信息不完整，则无法使用本服务或在使用过程中受到限制。

6.3 一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如服务上门）的考虑，您最好不要修改注册时提供的住址信息及其他验证信息。

6.4 凯达来将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。

6.5 未经您的同意，凯达来不会向凯达来以外的任何公司、组织和个人披露您的个人信息，但法律法规另有规定的除外。

七、主权利义务条款
7.1 账号使用规范
7.1.1 您在使用本服务前需要注册一个唯一的小蜜蜂智慧社区账号。注册账号时请按照软件的提示进行注册，为使填写的信息能尽快被核实通过，请填写您真实的个人及住址信息。

7.1.2 小蜜蜂智慧社区账号的所有权归凯达来所有，用户完成申请注册手续后，仅获得小蜜蜂智慧社区账号的使用权，且该使用权仅属于初始申请注册人，同时，初始申请注册人不得赠与、借用、租用、转让或售卖小蜜蜂智慧社区账号或者以其他方式许可非初始申请注册人使用小蜜蜂智慧社区账号。非初始申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用小蜜蜂智慧社区账号。

7.1.3 用户有责任妥善保管注册账户信息及账户密码的安全，用户需要对注册账户以及密码下的行为承担法律责任。用户同意在任何情况下不向他人透露账户及密码信息。在您怀疑他人在使用您的账号时，您应立即通知凯达来公司。

7.2 用户注意事项
7.2.1 您理解并同意：为了向您提供有效的服务，许可软件会利用您移动通讯终端的处理器和带宽等资源。许可软件使用过程中可能产生数据流量的费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。

7.2.2 您理解并同意凯达来将会尽其商业上的合理努力保障您在许可软件及服务中的数据存储安全，但是，凯达来并不能就此提供完全保证，包括但不限于以下情形：

7.2.2.1 凯达来不对您在许可软件及服务中相关数据的删除或储存失败负责；

7.2.2.2 凯达来有权根据实际情况自行决定单个用户在许可软件及服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。您可根据自己的需要自行备份许可软件及服务中的相关数据；

7.2.2.3 如果您停止使用许可软件及服务或服务被终止或取消，凯达来可以从服务器上永久地删除您的数据。服务停止、终止或取消后，凯达来没有义务向您返还任何数据。

7.2.3 用户在使用许可软件及服务时，须自行承担如下来自凯达来不可掌控的风险内容，包括但不限于：

7.2.3.1 由于不可抗拒因素可能引起的个人信息丢失、泄漏等风险；

7.2.3.2 用户必须选择与所安装手机相匹配的软件版本，否则，由于软件与手机型号不相匹配所导致的任何问题或损害，均由用户自行承担；

7.2.3.3 用户在使用许可软件访问第三方网站时，因第三方网站及相关内容所可能导致的风险，由用户自行承担；

7.2.3.4 用户发布的内容被他人转发、分享，因此等传播可能带来的风险和责任；

7.2.3.5 由于无线网络信号不稳定、无线网络带宽小等原因，所引起的小蜜蜂智慧社区登录失败、资料同步不完整、页面打开速度慢等风险。

7.2.4 为了提高园区订单（包括但不限于维修、投诉建议、咨询等）的流转速度，避免造成积压，同时也为了能够给您提供更高效的服务，在订单处理完成后请您及时进行确认并对我们的服务做出评价，若您因故未能在14日内进行订单确认，则系统会默认服务已经完成。

7.2.5 代表用户身份的二维码仅供本人用于在本系统中证明身份;

7.3 第三方产品和服务
7.3.1 您在使用许可软件第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的用户协议。凯达来和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。

八、用户行为规范
8.1 信息内容规范
8.1.1 您理解并同意，凯达来一直致力于为用户提供文明健康、规范有序的网络环境，您不得利用小蜜蜂智慧社区账号或许可软件及服务制作、复制、发布、传播如下干扰许可软件正常运营，以及侵犯其他用户或第三方合法权益的内容，包括但不限于：

8.1.1.1 发布、传送、传播、储存违反国家法律、危害国家安全统一、社会稳定、公序良俗、社会公德以及侮辱、诽谤、淫秽或含有任何性或性暗示的、暴力的内容；

8.1.1.2 发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；

8.1.1.3 涉及他人隐私、个人信息或资料的；

8.1.1.4 发表、传送、传播骚扰、广告信息及垃圾信息；

8.1.1.5 其他违反法律法规、政策及公序良俗、社会公德或干扰许可软件正常运营和侵犯其他用户或第三方合法权益内容的信息。

8.2 软件使用规范
除非法律允许或凯达来书面许可，您使用许可软件过程中不得从事下列行为：

8.2.1 删除许可软件及其副本上关于著作权的信息；

8.2.2 对许可软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现许可软件的源代码；

8.2.3 对凯达来拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；

8.2.4 对许可软件或者许可软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及许可软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非凯达来经授权的第三方工具/服务接入许可软件和相关系统；

8.2.5 通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；

8.2.6 通过非凯达来开发、授权的第三方软件、插件、外挂、系统，登录或使用小蜜蜂智慧社区软件及服务，或制作、发布、传播上述工具；

8.2.7 自行或者授权他人、第三方软件对许可软件及其组件、模块、数据进行干扰；

8.2.8 其他未经凯达来明示授权的行为。

8.3 服务运营规范
除非法律允许或凯达来书面许可，您使用本服务过程中不得从事下列行为：

8.3.1 提交、发布虚假信息，或冒充、利用他人名义的；

8.3.2 诱导其他用户点击链接页面或分享信息的；

8.3.3 虚构事实、隐瞒真相以误导、欺骗他人的；

8.3.4 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；

8.3.5 未经凯达来书面许可利用小蜜蜂智慧社区账号和任何功能，以及第三方运营平台进行推广或互相推广的；

8.3.6 利用小蜜蜂智慧社区账号或许可软件及服务从事任何违法犯罪活动的；

8.3.7 制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；

8.3.8 其他违反法律法规规定、侵犯其他用户合法权益、干扰产品正常运营或凯达来未明示授权的行为。

8.4 对自己行为负责
您充分了解并同意，您必须为自己注册账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。凯达来无法且不会对因前述风险而导致的任何损失或损害承担责任。

8.5 违约处理
8.5.1 如果凯达来发现或收到他人举报或投诉用户违反本协议约定的，凯达来有权不经通知随时对相关内容进行删除，并视行为情节对违规账号处以包括但不限于警告、限制或禁止使用全部或部分功能、账号封禁直至注销的处罚，并公告处理结果。

8.5.2 您理解并同意，凯达来有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。

8.5.3 您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；凯达来因此遭受损失的，您也应当一并赔偿。

九、知识产权声明
9.1 凯达来是许可软件的知识产权权利人。许可软件的一切著作权、商标权、专利权、商业秘密等知识产权，以及与许可软件相关的所有信息内容（包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，凯达来享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。

9.2 未经凯达来或相关权利人书面同意，您不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。

十、终端安全责任
10.1 您理解并同意，许可软件同大多数互联网软件一样，可能会受多种因素影响，包括但不限于用户原因、网络服务质量、社会环境等；也可能会受各种安全问题的侵扰，包括但不限于他人非法利用用户资料，进行现实中的骚扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁您的终端设备信息和数据安全，继而影响许可软件的正常使用等。因此，您应加强信息安全及个人信息的保护意识，注意密码保护，以免遭受损失。

10.2 您不得制作、发布、使用、传播用于窃取小蜜蜂智慧社区账号及他人个人信息、财产的恶意程序。

10.3 维护软件安全与正常使用是凯达来和您的共同责任，凯达来将按照行业标准合理审慎地采取必要技术措施保护您的终端设备信息和数据安全，但是您承认和同意凯达来并不能就此提供完全保证。

10.4 在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意凯达来有关防范诈骗犯罪的提示。

10.5 若其他用户发布有攻击性的内容时，您可以通过提交举报或屏蔽的方式进行设置。也可在设置中取消对其用户的屏蔽。

十一、第三方软件或技术
11.1 许可软件可能会使用第三方软件或技术（包括许可软件可能使用的开源代码和公共领域代码等，下同），这种使用已经获得合法授权。

11.2 许可软件如果使用了第三方的软件或技术，凯达来将按照相关法规或约定，对相关的协议或其他文件，可能通过本协议附件、在许可软件安装包特定文件夹中打包等形式进行展示，它们可能会以“软件使用许可协议”、“授权协议”、“开源代码许可证”或其他形式来表达。前述通过各种形式展现的相关协议或其他文件，均是本协议不可分割的组成部分，与本协议具有同等的法律效力，您应当遵守这些要求。如果您没有遵守这些要求，该第三方或者国家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求凯达来给予协助，您应当自行承担法律责任。

11.3 如因许可软件使用的第三方软件或技术引发的任何纠纷，应由该第三方负责解决，凯达来不承担任何责任。凯达来不对第三方软件或技术提供客服支持，若您需要获取支持，请与第三方联系。

十二、账号注销
12.1您可以通过以下方式注销您的账号：

登入小蜜蜂智慧社区APP，通过“我的-设置-账号管理-注销账号”来注销账号。在您注销账号前，请确保你在小蜜蜂智慧社区APP的账号同时满足以下条件，否则你注销账号的申请可能会被拒绝：

（1）账户在小蜜蜂智慧社区APP中无资产、无欠款；

（2）账户内无未完成的订单、已提供服务单未支付的订单/服务；

在您主动注销账户之后，我们将停止为您提供产品或服务，我们将删除您的个人信息，使其保持不可被检索、访问的状态，或对使其进行匿名化处理。

12.2若想要删除部分您所填写的信息，如实名认证中（身份证号、身份证图像），请通过0574-87760023与我们联系。

深圳市凯达来科技有限公司
2020年10月21日

      ''',
          style: TextStyle(
            fontSize: 30.w,
          ),
        ),
      ),
    );
  }
}
