import 'package:aku_new_community/utils/headers.dart';
import 'package:aku_new_community/widget/bee_scaffold.dart';
import 'package:flutter/material.dart';

class PrivacyPage extends StatefulWidget {
  PrivacyPage({Key? key}) : super(key: key);

  @override
  _PrivacyPageState createState() => _PrivacyPageState();
}

class _PrivacyPageState extends State<PrivacyPage> {
  @override
  Widget build(BuildContext context) {
    return BeeScaffold(
      title: '隐私政策',
      body: SingleChildScrollView(
        padding: EdgeInsets.all(16.sp),
        child: Text(
          '''
最近更新日期：2022年03月25日
本隐私政策的摘要主要向您说明：我们在必要范围内收集和使用您的个人信息类型和业务场景，以及我们处理您个人信息的基本规则。
小蜜蜂深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。小蜜蜂承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
若您想要了解我们收集和使用您的个人信息的详细内容，请仔细阅读并了解 《隐私政策》（尤其是加粗及下划线部分）。
一、我们收集您哪些个人信息
小蜜蜂仅会 出于必要的业务场景，收集和使用您的个人信息 ，以便向你提供对应的服务，若您不提供相关的个人信息，将无法享受相应的服务内容，以下为部分场景及其获取信息示例。
产品功能： ：在使用存储服务时，会获取一些必要信息。如：获取您的 手机号码 用于 注册 ；获取您的手机 存储状态 用于 创建本地目录 ；在使用 照片、视频、文件和通讯录 等备份功能时和 文件预览及传输 时，读取对应的 本地文件信息 ；查看 网络状态 用于 登录 和 绑定设备。
系统权限： 为提供更好的服务体验，我们会向您申请一些系统权限。如：获取 存储权限 用于 传输文件 ；获取 相机权限 用于 拍照上传 和 扫一扫； 获取 麦克风权限 用于绑定对应设备的 语音对讲、录音发布。
您的个人信息大部分是由您 主动向我们提供或授权 的，也有我们在您使用我们的产品或服务时 通过Cookies、SDK及类似技术获取 的。我们会采取一切合理可行的措施，保护您站点下用户的个人信息。
二、我们如何共享您的信息
为了向您提供全部的服务内容，我们需要同我们的合作伙伴一起为您提供服务，因此，在获取您的明确同意后，我们会 委托授权合作伙伴为您提供某些服务或代表我们履行职能 。我们仅会处于本隐私政策声明的合法、正当、必要、特定、明确的目的共享您的信息。我们会采取必要的技术和管理措施保护您的个人信息安全。
三、您的权力
在遵循相关法律、法规及标准的情况下，您有权 访问、更正、删除您的个人信息以及注销账户 ，有权 改变或撤回已授权同意的个人信息和权限。
若进行上述操作时遇到问题，您可以联系我们，我们会在七个工作日内作出回复。为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。
四、儿童个人信息保护
我们的产品、网站和服务主要面向企业级用户，用户对象一般为成人。如果没有父母或监护人的同意，儿童不得创建自己的用户账户。
我们将不满 14 周岁的任何人均视为儿童。对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。
五、如何联系我们
如果您对本隐私政策有任何疑问、意见或建议，可发送邮件至kaidalai@163.com
也可以在线反馈等多种方式与我们联系。
您反馈的信息我们将有专人跟进负责处理。我们将在十五个工作日内回复。
如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，您还可以通过法律途径或前往行业自律协会等机构寻求解决方案。
用户隐私政策
最近更新日期：2022年03月25日
版本生效日期：2022年03月27日
如果您有任何疑问、意见或建议，请您把问题发送到邮箱：kaidalai@163.com，我们将在7个工作日内进行处理。
本政策将帮助您了解以下内容：
1、我们收集您哪些个人信息；
2、我们如何使用您的个人信息；
3、我们如何共享、转让、公开披露您的个人信息；
4、我们如何存储您的个人信息；
5、我们如何保护您的个人信息；
6、您的权利；
7、我们如何处理儿童的个人信息；
8、本政策如何更新；
9、如何联系我们；
小蜜蜂深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，小蜜蜂承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
为了便于您了解您在使用我们的服务时，我们需要收集的信息类型与用途，我们将结合具体服务向您逐一说明。请在使用我们的产品（或服务）前，仔细阅读并了解本《隐私政策》（尤其是加粗及下划线部分）。
一、我们收集您哪些个人信息
个人信息是指以电子或者其他方式记录的与已识别或者可识别的自然人有关的各种信息，不包括匿名化处理后的信息。
敏感个人信息是指一旦泄露或者非法使用，容易导致自然人的人格尊严受到侵害或者人身、财产安全受到危害的个人信息，包括生物识别、宗教信仰、特定身份、医疗健康、金融账户、行踪轨迹等信息，以及不满十四周岁未成年人的个人信息。
小蜜蜂仅会出于本政策所述的以下目的，收集和使用用户的个人信息：
（一）产品功能
1、业务功能一：注册成为用户
为完成创建账号，您需提供手机号码，用于小蜜蜂账号免密登录或短信验证注册。用户注册完成后，会默认使用您的手机号码作为小蜜蜂的用户名。如果不同意，将无法完成注册。
此外在历史的客户端版本内（Android端V8.0.0及以下版本，iOS端V7.4.0及以下版本），您可以登录应用后访问【“我的”->点击头像进入“个人资料”页】进行查询和设置您的其他信息（包含姓名，昵称，性别等信息）。
您提供的上述信息，将在您使用本服务期间持续授权我们使用。在您注销账号时，我们将停止使用并删除上述信息。
我们使用的账号为小蜜蜂账号，以上用户账号相关的信息，均存储于小蜜蜂账号服务器中。上述信息将存储于中华人民共和国境内。如需跨境传输，我们将会单独征得您的授权同意。
2、业务功能二：文件预览及传输
小蜜蜂提供预览、传输功能，当加载文件列表或预览文件时，为了方便您下次可快速预览，会对文件数据进行临时缓存；当使用文件传输功能时（如上传、下载），需要 读取本机设备的文件，供您选择需要上传的文件，下载文件时，需要 获取手机存储状态，确认本地存储空间剩余容量，并将文件保存至本机设备内。
3、业务功能三：联系人分享
小蜜蜂提供文件分享功能，支持通过手机号分享文件，当使用这个功能时，需要您授权同意读取用户终端内的通讯录。如果不同意，将会无法使用联系人分享功能。
4、业务功能四：文件下载
小蜜蜂提供app下载pdf等格式文件功能，当使用这个功能时，需要您授权同意获取读写手机存储权限。如果不同意，将会无法使用文件下载功能。
5、业务功能五：文件分享
我们会从您的Android终端 读取应用列表，用于在分享文件时判断第三方应用是否已安装在本机，以及辅助检测小蜜蜂安卓客户端是否在前台显示。但如果您不提供这些信息，可能会影响您使用本功能。
（二）其他信息
1、活动运营： 小蜜蜂会开展运营活动，在您中奖时，会让您提供 姓名、联系方式、地址 用于奖品寄送。这些信息属于个人敏感信息，您可以拒绝提供，如果拒绝提供，您将可能无法参与运营活动或无法获得奖品，但不影响其他功能和服务的正常使用。
2、信息推送： 为了更好为您提供服务，我们引入了第三方消息推送SDK和短信通道实现对您及时的信息推送服务，需要向您收集的信息仅包含 设备型号、设备MAC地址、应用名称与版本、设备APPlist、操作系统类型版本、设备型号与类型。
3、计费收费： 小蜜蜂提供多档次、多功能的会员服务，您在订购不同会员的时候我们会通过终端设备采集产生的 日志信息（包括不限于订购手机号、订购套餐类型、订购费用、订购时间） 。订购信息及手机号用于用户管理和订单管理。问卷答复：我们可能会不定期向您投放用户体验改善的调查问卷，您如果参与问卷调查的话，可能会收集到您提供的信息内容。
（三）权限说明
业务功能	对应权限	调用权限目的	是否询问	可否关闭
安装与卸载应用	创建桌面快捷方式的权限	安装小蜜蜂客户端时 部分Android终端需要使用您的创建桌面快捷方式的权限， 生成系统桌面图标。如果您卸载小蜜蜂客户端，卸载后我们不会在终端设备内保留您的用户信息。如果不同意，部分Android终端可能无法在终端主页面创建桌面快捷方式，需要您进入系统的抽屉式桌面才可访问小蜜蜂客户端。	否	否
获取存储状态及记录功能配置信息	获取读写手机存储权限	当您启动小蜜蜂客户端时，需要获取 手机存储状态 加载配置信息，及创建用于存储缓存数据、crash日志信息的本地目录。 需要您授权同意获取读写手机存储权限 。如果不同意，将无法记录用户家庭配置信息、相册备份状态，无法写入日志。	是	是
登录	安卓设备会使用到以下权限：查看网络连接（允许应用查看网络连接的相关信息），更改WLAN状态（允许应用程序连接到WLAN接入点以及WLAN接入点断开连接，并对配置的WLAN网络进行更改），更改网络连接性权限（允许该应用更改网络连接的状态）	小蜜蜂支持免密登录、账密登录、以及短信登录。在登录过程中需要检查您的网络环境（是移动网络还是在WiFi环境下），登录过程 安卓设备会使用到以下权限：查看网络连接（允许应用查看网络连接的相关信息），更改WLAN状态（允许应用程序连接到WLAN接入点以及WLAN接入点断开连接，并对配置的WLAN网络进行更改），更改网络连接性权限（允许该应用更改网络连接的状态）。	否	否
退出	展开/收拢状态栏权限	小蜜蜂会在您的安卓终端设备内使用 展开/收拢状态栏权限， 当您在小蜜蜂退出账号时，用于清空保留在状态栏提示的消息。	否	否
拍照上传	获取相机权限	小蜜蜂提供拍照上传功能， 此功能需要您同意获取相机权限 。如果不同意，将无法开启摄像头进行拍照上传。	是	是
文件预览及传输	读取本机设备文件、获取手机存储状态、获取读写手机存储权限	当使用文件传输功能时（如上传、下载），需要 读取本机设备的文件 ，供您选择需要上传的文件，下载文件时，需要 获取手机存储状态 ，确认本地存储空间剩余容量，并将文件保存至本机设备内。这些功能 需要您授权同意获取读写手机存储权限 。如果不同意，将无法预览文件，无法加载文件列表或加载缓慢，无法上传、下载文件。	是	是
相册备份	开机启动权限、防止手机休眠权限	在安卓终端设备内，为了不让应用进程被回收，导致相册备份失败，小蜜蜂会用到您的 开机启动权限和防止手机休眠权限 。iOS终端设备因系统原因，需要您手动打开后台备份，才支持后台自动备份。	是	是
扫一扫	获取相机权限、控制振动权限	小蜜蜂提供扫一扫功能，您可以使用此功能进行扫描二维码登录PC端、TV端以及web门户，或扫描分享的文件二维码转存文件。 此功能需要您同意获取相机权限 ，如果不同意，将无法开启摄像头，最终无法执行上述操作。在您开启摄像头并扫描二维码后，小蜜蜂 安卓版会使用控制振动权限 ，扫描成功后进行振动反馈。	是	是
应用备份与恢复（仅适用于安卓端v8.5.3及之前的版本）	读取应用列表信息权限	小蜜蜂提供应用备份与恢复功能，支持备份设备内已安装应用的记录，以及根据已备份至云端的应用列表清单执行下载操作恢复至您的移动终端设备内。此功能不会对应用内产生的数据备份至云端，仅备份应用列表清单，当用户选择恢复至本地设备时，仅对已备份的应用列表清单做下载应用操作。当使用应用备份与恢复功能时， 需要您授权同意读取应用列表信息权限 。如果不同意，将无法使用本功能。	是	是
设备内的消息提示	检索正在运行的应用的权限	小蜜蜂在文件操作完成后，顶部会出现toast提示。安卓终端设备在实现此功能时，需要使用 检索正在运行的应用 的权限。	否	是
推送通知	开机启动权限、同意开启通知权限	小蜜蜂支持向移动终端设备推送通知，方便您及时收到好友分享通知、优惠信息、系统公告，信息可能会按手机号码归属地分别推送。此功能会用到您的 开机启动权限 以及需要您授权同意 开启通知 ，如果您不同意，可在APP内【“我的”-“设置”- “接受消息推送”】进行关闭。	是	是
指纹密码，指纹验证，面容ID解锁，面容ID验证	安卓终端设备内使用管理指纹（IFAA）权限、iOS终端设备内使用面容ID、指纹密码	如果您的终端设备支持指纹识别或人脸识别，小蜜蜂还提供 指纹密码，面容ID解锁（面容ID为小蜜蜂iOS端特有功能） 功能，用于登录小蜜蜂。您可以在小蜜蜂客户端内开启或关闭某项生物识别功能，即您可以分别选择开通或关闭指纹密码、面容ID解锁、指纹验证、面容ID验证中的一项或多项。 您的指纹特征和人脸特征由您录入指纹和录入人脸当时的载体（如手机或其他智能手持终端设备）及其系统保存，小蜜蜂不会保存您的指纹特征和人脸特征。 小蜜蜂会在您的 安卓终端设备内使用管理指纹（IFAA）权限、您的iOS终端设备内使用面容ID、指纹密码 ，用于验证登录及解锁APP。	是	是
绑定设备	查看网络连接、查看WLAN状态、更改WLAN状态、更改网络连接性、完全的网络访问权限	小蜜蜂还提供了智能硬件设备服务，在给硬件设备配网时，我们需要 获取 Wi-Fi SSID ，除此以外，安卓设备还会使用到以下权限： 查看网络连接 （允许应用查看网络连接的相关信息）， 查看WLAN状态 允许应用查看有关WLAN状态的信息）， 更改WLAN状态 （允许应用程序连接到WLAN接入点以及WLAN接入点断开连接，并对配置的WLAN网络进行更改）， 更改网络连接性 （允许该应用更改网络连接的状态）， 完全的网络访问权限 允许应用创建网络套接字和使用自定义网络协议）。	否	否
语音对讲	使用手机麦克风权限、更改用户音频设置权限	当您在小蜜蜂客户端内绑定了智能硬件设备后，部分智能硬件设备支持语音对讲功能， 您在使用此功能前，需要您授权同意使用手机麦克风 ，如果您不同意，将会导致无法与设备语音对讲。安卓设备还会使用到 更改您的音频设置权限 （允许应用修改全局音频设置），方便您控制音量或在遥控器中对小蜜蜂高清进行语音控制。	是	是
连接蓝牙设备	使用大致位置权限	小蜜蜂支持特定的蓝牙设备通过小蜜蜂应用小程序连接到手机或其他智能手持终端设备。在您允许开启蓝牙服务且进行蓝牙设备连接操作时， 需要您授权同意使用大致位置权限 ，用于搜索周围的蓝牙设备，如果您不同意，将会导致Android系统版本6.0以上终端无法发现周围可连接的蓝牙设备，最终导致无法连接。	是	是
查找并连接到本地网络上的设备	使用查找并连接到本地网络上的设备权限	小蜜蜂还提供了连接本地智能硬件设备服务，当您在小蜜蜂客户端内使用打印、投屏、动感影集小程序、我家硬盘小程序时， 需要您授权同意使用查找并连接到本地网络上的设备权限 ，用于应用使用 Bonjour发现兼容“隔空打印”的打印机，或发现兼容“隔空播放”的设备（如 Apple TV），如果您不同意，将无法发现本地网络中可连接的打印或投屏设备，最终导致无法连接本地硬件。	是	是
安全管理	获取小蜜蜂安卓终端和iOS终端的设备型号	为了保障向您提供的服务的安全稳定运行，预防传输过程的风险（如识别是否常用设备登录，是否常用位置登录），我们会对您使用的 小蜜蜂Android终端、iOS终端的设备型号 进行记录。如果您不同意，可能无法完成风控验证。	是	是
（四）SDK与代码使用
在您使用小蜜蜂APP的功能或者服务时，在某些特定使用场景下，我们可能会使用具有相应业务资质及能力的第三方服务商提供的软件服务工具包（简称SDK）和代码来为您提供服务。 小蜜蜂无法获得您在使用该类SDK服务时产生的信息。但是，如果你已明示同意该SDK获得你的数据信息，该SDK将通过小蜜蜂接口获得你的数据信息 。关于第三方SDK具体调用的设备权限类型，以及如何收集、使用您的个人信息，建议您参考第三方SDK的相关服务协议及隐私政策。如果您希望进一步了解我们所接入的第三方SDK情况，请您阅读第三方SDK情况说明。

（五）我们如何使用Cookie 和同类技术
1、Cookie
在您访问我们的网站时，我们会在您的计算机或移动设备中存储名为Cookie的小数据文件。Cookie通常包含了一些标识符，主要存储了用户标识（不涉及用户真实名称）、用户访问的时间以及用户访问页面的字符。借助Cookie标识，能够帮助网站统计用户的访问频次、访问页面偏好及接入网站的加载性能的数据，用于确保网站正常高效运转、保护您的数据安全。
我们不会将 Cookie用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。有关详情，请参见 AboutCookies.org。您可以清除计算机上保存的所有Cookie，大部分网络浏览器都设有阻止Cookie 的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置。
2、网站信标和像素标签
除 Cookie 外，我们还会在网站上使用网站信标和像素标签及其他同类技术。由于小蜜蜂产品需要嵌入到第三方的网站中，受同源策略的影响，为了能准确发送统计结果，小蜜蜂使用了网站信标和像素标签及其他同类技术，如用户在访问了您的网站时，我们会通过像素标签的方式，将用户访问的页面信息、网站加载性能数据通过该技术去跨域发送到采集服务，以实现后续的运营指标及性能指标数据的统计、分析。所有通过网站信标及像素标签技术发起的请求，都通过HTTPS方式发送，SSL会对数据进行加密，您的数据都在加密协议下传输。
3、本地存储器
除上述技术外，小蜜蜂还启用了本地存储器的方式，对您网站的访问者的一些交互行为进行记录，这部分数据主要为了帮助您对网站的点击生成热力分布，方便运营决策者优化自己的网站结构，所有用户数据都存在用户自身的本地浏览器中。同时，数据在通过HTTPS发送到服务器后，小蜜蜂会对用户的本地数据进行清除，确保数据的安全性。
4、Do Not Track（请勿追踪）
很多网络浏览器均设有 Do Not Track 功能，该功能可向网站发布 Do Not Track 请求。目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果您的浏览器启用了 Do Not Track，那么我们的所有网站都会尊重您的选择。
（六）征得授权同意的例外
您充分理解并同意，我们在以下情况下收集、使用您的个人信息无需您的授权同意，且我们可能不会响应您提出的更正/修改、删除、注销、撤回同意、索取信息的请求：
1、与国家安全、国防安全直接相关的；
2、与公共安全、公共卫生、重大公共利益直接相关的；
3、与犯罪侦查、起诉、审判和判决执行等直接相关的；
4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
5、您自行向社会公众公开的个人信息；
6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
7、根据与您签订和履行相关协议或其他书面文件所必需的；
8、用于维护所提供的产品及/或服务的安全稳定运行所必需的，包括但不限于发现、处置产品及/或服务的故障；
9、为合法的新闻报道所必需的；
10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
11、法律法规规定的其他情形。
二、我们如何使用您的个人信息
1、我们会保持您的个人数据及时更新；安全地存储或销毁它；最小化收集和保留我们需要为您提供服务所需的数据；保护个人信息免遭泄露、滥用、未经授权的访问和披露；采取适当的技术措施保护您个人信息的安全。
2、我们将您的信息用于以下用途：
（1）根据我们与您签订的合同向您提供服务。
（2）实现您的服务请求，包括履行订单；交付、激活或验证产品或服务；参加线上或线下活动；应您的要求进行变更或者提供您请求的信息（包括但不限于产品或服务的营销资料）；以及提供技术支持。
（3）向您发送有关您可能感兴趣的产品和服务的信息；邀请您参与商城活动（包括促销活动）、市场调查或满意度调查；或向您发送营销信息。
（4） 按照我们收集信息时所述的要求提供其他您所要求的服务。
（5）维持我们储存和处理您个人信息的数据技术系统的完整性和安全性。
（6）执行或保护我们的协议或与您签订的合同。
（7）检测和调查信息泄露、非法活动和欺诈行为。
（8）联系您解决问题。
（9）经过您许可的其它用途。
3、需要注意的是，以上使用方式涵盖了我们使用您信息的主要方式。我们可能根据实际需要通过更新网站页面、APP、小程序或设备固件等方式，为用户提供更加多样化的服务。当我们要将信息用于本协议未载明的其他用途时，或要将基于特定目的收集而来的信息用于其他目的时，会以签署协议、弹窗提示、更新本协议等形式再次征求您的同意。
三、我们如何共享、转让、公开披露您的个人信息
（一）共享
我们不会与任何公司、组织和个人分享您的个人信息，但以下情况除外：
1、我们可能会根据法律法规规定，或按政府主管部门的强制性要求， 对外共享您的个人信息（见本协议第一（一）、（二）条中描述需要收集您个人信息种类）。
2、在获取明确同意的情况下共享：获取您的明确同意后，我们会与其它方共享您已明确同意的个人信息。
3、与授权合作伙伴的共享
我们可能委托授权合作伙伴为您提供某些服务或代表我们履行职能，我们仅会处于本隐私政策声明的合法、正当、必要、特定、明确的目的共享您的信息，授权合作伙伴只能接触到其履行职责所需信息（如您选择云冲印的照片提供给服务提供方，见本协议第一（四）条中描述需要向您请求访问云盘内的照片），且不得将此信息用于其他任何目的。
目前，我们的授权合作伙伴包括以下类型：
供应商和服务提供商。我们将信息发送给支持我们服务的服务提供商，这些支持包括受我们委托向用户提供技术和基础硬件服务、分析我们服务的使用方式。
我们会对授权合作伙伴获取有关信息的应用程序接口（API）、软件工具开发包（SDK）进行严格的安全检测，并于授权合作伙伴约定严格的数据保护措施，令其按照我们的委托目的、服务说明、本隐私政策以及其它相关的保密和安全措施来处理个人信息。
（二）转让
我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意（见本协议第一（一）、（二）条中描述需要收集您个人信息种类）。在涉及兼并、重组或破产清算情形时，我们会要求新的承接您个人信息的公司、组织继续受本协议的约束，承接数据安全责任和义务，否则我们将要求该公司、组织和个人重新向您征求授权同意，没有数据承接方的，将对数据作销毁处理。
（三）公开披露
我们仅会在以下情况下，公开披露您的个人信息：
基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息（见本协议第一（一）、（二）条中描述需要收集您个人信息种类）。
四、我们如何存储您的个人信息
我们在中华人民共和国境内运营中收集和产生的个人信息，存储在中国境内。由于我们的产品不涉及跨境业务，您的数据不会涉及跨境传输。除非法律有另外规定，小蜜蜂将按照如下期限保存您的信息：
1、在您使用小蜜蜂产品或服务期间，我们将持续为您保存，将严格按照国家有关规定做好您数据存储工作，除非您主动删除或注销小蜜蜂帐号。
2、我们将根据小蜜蜂的数据备份策略定期对收集的信息进行备份处理。
3、我们仅为实现目的所必需的最短时间保留您的个人信息。但在下列情况下，我们有可能因需符合法律要求，更改个人信息的存储时间：
•为遵守适用的法律法规等有关规定；
•为遵守法院判决、裁定或其他法律程序的规定；
•为遵守相关政府机关或法定授权组织的要求；
•我们有理由确信需要遵守法律法规等有关规定；
•为执行相关服务协议或本政策、维护社会公共利益，为保护我们的客户、我们或我们的关联公司、其他用户或雇员的人身财产安全或其他合法权益所合理必需的用途。
当我们要将信息用于本政策未载明的其它用途时，会事先征求您的同意。当我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。
4、对于所收集的信息，我们将在法律规定的最短期限内保存，超出保存期限后，我们将对所收集的信息进行匿名化处理。您的个人信息经过匿名化与脱敏处理后将形成可以使用的流通数据，小蜜蜂对此数据的保存和使用无需另外征得您的同意。
5、当您删除信息或注销小蜜蜂帐号后，小蜜蜂将停止对您个人信息的使用，并在一定期限内删除您的个人信息或匿名化处理。
6、当我们停止运营其产品或服务时，我们将：
（1）及时停止继续收集您个人信息的活动。
（2）将停止运营的通知以送达或公告的形式通知您。
（3）对我们所持有的个人信息进行删除或匿名化处理。
五、我们如何保护您的个人信息
（一）我们已使用符合业界标准的安全防护措施保护您提供的个人信息， 防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您站点下用户的个人信息。在您站点用户的浏览器与“服务”之间交换数据（如采集用户访问频次、访问偏好及网站性能）时受 SSL加密保护；我们同时对小蜜蜂网站提供 https 安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
（二）我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期（详见一、（七）存储信息的期限）或受到法律的允许。
（三）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送小蜜蜂账号信息。请使用复杂密码，协助我们保证您的账号安全。
（四）互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
（五）在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
（六）对于所收集的信息，我们将在法律规定的最短期限内保存，超出保存期限后，我们将对所收集的信息进行匿名化处理。
六、您的权利
按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：
（一）访问您的个人信息
您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：
账户信息——为了您的个人信息安全，您的手机号会进行脱敏显示。您可以通过【“我的”->点击“头像”-“个人资料”】查看您的用户头像、昵称、小蜜蜂账号（手机号）。目前APP内支持修改用户头像及昵称。如果您希望更改您的密码、添加安全信息或关闭您的账户，您也可以通过小蜜蜂APP内执行此类操作。如果您无法通过上述链接访问这些个人信息，请您把问题发送到邮箱：kaidalai@163.com，我们将在7个工作日内回复您的请求。
（二）更正您的个人信息
当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正。您可以通过“（一）访问您的个人信息”中罗列的方式提出更正申请。
如果您无法通过上述链接更正这些个人信息，请您把问题发送到邮箱：kaidalai@163.com，我们将在7个工作日内回复您的更正请求。
（三）删除您的个人信息
您可以通过发送邮件到邮箱：kaidalai@163.com联系我们进行信息删除，我们将在七个工作日内做出答复。若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
（四）个人信息主体注销账户
您随时可注销此前注册的账户，您可以通过以下方式自行操作：
1、手机端（安卓/iOS）在登录界面，进入【帮助->查看其它问题->我怎么注销账号】
2、手机端（安卓/iOS）在【“我的”->点击头像进入“设置”页面->点击“安全中心”->“小蜜蜂账号注销”】
在注销账户之后，我们将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。
（五）改变您授权同意的范围
小蜜蜂业务功能可能需要一些基本的个人信息才能得以完成（见本协议中的第一条（一）、（二））。除此之外，对于额外个人信息的收集和使用，您可以与通过发送邮件以及联系个人信息保护相关负责人给予或撤回授权（联系方式见本协议第九条）。
对于您已经授权同意我们收集和使用的终端设备权限信息，您可以通过在终端设备进行设置、改变或撤回您的授权同意，Android终端可点击【系统设置->应用与权限->应用权限管理】进行设置，iOS终端可点击【系统设置->小蜜蜂】进行设置。您也可以在本APP中【“我的”->点击头像进入“设置”页面->点击“安全中心”->“小蜜蜂账号注销”】的路径撤回授权同意。您改变或撤回授权同意后，可能无法使用相应的功能服务。
当您收回同意后，我们将不再处理相应的个人信息。 但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。
（六）响应您的上述请求
为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。
我们将在七个工作日内做出答复。
对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。
在以下情形中，按照法律法规要求，我们将无法响应您的请求：
1、与国家安全、国防安全直接相关的；
2、与公共安全、公共卫生、重大公共利益直接相关的；
3、与犯罪侦查、起诉、审判和判决执行等直接相关的；
4、有充分证据表明您存在主观恶意或滥用权利的；
5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；
6、涉及商业秘密的。
七、我们如何处理儿童的个人信息
我们的产品、网站和服务主要面向企业级用户，用户对象一般为成人。如果没有父母或监护人的同意，儿童不得创建自己的用户账户。
对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。
尽管当地法律和习俗对儿童的定义不同，但我们将不满 14 周岁的任何人均视为儿童。如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。
八、本政策如何更新
我们的隐私政策可能变更。
未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。我们会在本页面上发布对本政策所做的任何变更。
对于重大变更，我们还会提供更为显著的通知（包括对于某些服务， 我们会通过电子邮件发送通知，说明隐私政策的具体变更内容）。
本政策所指的重大变更包括但不限于：
1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
2、我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
3、个人信息共享、转让或公开披露的主要对象发生变化；
4、您参与个人信息处理方面的权利及其行使方式发生重大变化；
5、我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
6、个人信息安全影响评估报告表明存在高风险时。我们还会将本政策的旧版本存档，供您查阅。
九、如何联系我们
如果您对本隐私政策有任何疑问、意见或建议，也通过以下方式与我们联系：
电子邮箱：kaidalai@163.com
个人信息保护相关负责人联系方式：kaidalai@163.com
您反馈的信息我们将有专人跟进负责处理。我们将在十五个工作日内回复。
如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，您还可以通过法律途径或前往行业自律协会等机构寻求解决方案。
企业名称：深圳市凯达来科技有限公司
地点：深圳市龙岗区横岗街道沙荷路40-11号
    ''',
          style: TextStyle(
            fontSize: 30.w,
          ),
        ),
      ),
    );
  }
}
